---
title: IntegerRange
classe: Autodesk.Revit.DB.IntegerRange
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# IntegerRange

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 High { get; }` | `integerRange.High` | Int32 |
| `Boolean IsValidObject { get; }` | `integerRange.IsValidObject` | Boolean |
| `Int32 Low { get; }` | `integerRange.Low` | Int32 |
| `Void Dispose()` | `integerRange.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```